In [1]:
import pandas as pd #pandas

In [2]:
import numpy as np #다차원의 숫자 배열을 파이썬에서 효율적으로 처리하기 위한 모듈

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8]) #pansdas 자료구조 Series 생성, 1차원 : index를 사용하여 참조

In [5]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6) #pandas 자료구조 DataFrame 생성, 2013-01-01을 기준으로 6개, 2차원:index,colunms

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD')) 
#임의의 값을 가지는 6x4 DataFrame 생성, index는 dates, columns는 ABCD

In [9]:
df

                   A         B         C         D
2013-01-01 -1.183526 -0.759022  0.577284 -1.592506
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314
2013-01-03 -1.158142  0.771705  0.579984 -0.506668
2013-01-04  1.856392  0.006193  0.746496 -0.089361
2013-01-05 -2.955706 -0.340287 -0.318017  0.288200
2013-01-06 -0.495877 -0.638595 -1.250311 -1.560737

In [10]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),#Series를 DataFrame에 넣기
                    'D' : np.array([3] * 4,dtype='int32'), #4개짜리 배열에 3의 값을 입력
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [11]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [12]:
df2.dtypes #각 columns의 데이터 타입을 출력

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head() #마지막 행을 제외한 나머지 행을 출력

                   A         B         C         D
2013-01-01 -1.183526 -0.759022  0.577284 -1.592506
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314
2013-01-03 -1.158142  0.771705  0.579984 -0.506668
2013-01-04  1.856392  0.006193  0.746496 -0.089361
2013-01-05 -2.955706 -0.340287 -0.318017  0.288200

In [14]:
df.head(2) #위에서 부터 2개의 행을 출력

                   A         B         C         D
2013-01-01 -1.183526 -0.759022  0.577284 -1.592506
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314

In [15]:
df.tail(3) #아래에서 3개의 행을 출력

                   A         B         C         D
2013-01-04  1.856392  0.006193  0.746496 -0.089361
2013-01-05 -2.955706 -0.340287 -0.318017  0.288200
2013-01-06 -0.495877 -0.638595 -1.250311 -1.560737

In [16]:
df.index #Data Frame의 index를 출력

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [17]:
df.columns #Data Frame의 각 열의 이름을 출력

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [18]:
df.values #Data Frame의 각 값을 출력

array([[-1.18352558, -0.75902195,  0.57728441, -1.59250622],
       [-0.67757726,  0.76254167, -1.61138335, -0.82631434],
       [-1.15814188,  0.77170498,  0.579984  , -0.50666803],
       [ 1.85639168,  0.00619328,  0.7464956 , -0.08936101],
       [-2.95570557, -0.34028707, -0.31801707,  0.28820049],
       [-0.49587702, -0.63859495, -1.25031142, -1.56073672]])

In [19]:
df.describe() #Data Frame의 한 열의 갯수, 평균, 최소, 최대등을 표시

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.769073 -0.032911 -0.212658 -0.714564
std    1.554386  0.673832  1.021423  0.766670
min   -2.955706 -0.759022 -1.611383 -1.592506
25%   -1.177180 -0.564018 -1.017238 -1.377131
50%   -0.917860 -0.167047  0.129634 -0.666491
75%   -0.541302  0.573455  0.579309 -0.193688
max    1.856392  0.771705  0.746496  0.288200

In [20]:
df.T #열과 행을 바꿔서 출력

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.183526   -0.677577   -1.158142    1.856392   -2.955706   -0.495877
B   -0.759022    0.762542    0.771705    0.006193   -0.340287   -0.638595
C    0.577284   -1.611383    0.579984    0.746496   -0.318017   -1.250311
D   -1.592506   -0.826314   -0.506668   -0.089361    0.288200   -1.560737

In [21]:
df.sort_index(axis=1, ascending=False) #열이름을 기준으로 역순으로 정렬

                   D         C         B         A
2013-01-01 -1.592506  0.577284 -0.759022 -1.183526
2013-01-02 -0.826314 -1.611383  0.762542 -0.677577
2013-01-03 -0.506668  0.579984  0.771705 -1.158142
2013-01-04 -0.089361  0.746496  0.006193  1.856392
2013-01-05  0.288200 -0.318017 -0.340287 -2.955706
2013-01-06 -1.560737 -1.250311 -0.638595 -0.495877

In [22]:
df.sort(columns='B') #B열의 값을 기준으로 행을 정렬

                   A         B         C         D
2013-01-01 -1.183526 -0.759022  0.577284 -1.592506
2013-01-06 -0.495877 -0.638595 -1.250311 -1.560737
2013-01-05 -2.955706 -0.340287 -0.318017  0.288200
2013-01-04  1.856392  0.006193  0.746496 -0.089361
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314
2013-01-03 -1.158142  0.771705  0.579984 -0.506668

In [23]:
df['A'] #A열의 값만 출력

2013-01-01   -1.183526
2013-01-02   -0.677577
2013-01-03   -1.158142
2013-01-04    1.856392
2013-01-05   -2.955706
2013-01-06   -0.495877
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3] #1행에서 3행까지 출력

                   A         B         C         D
2013-01-01 -1.183526 -0.759022  0.577284 -1.592506
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314
2013-01-03 -1.158142  0.771705  0.579984 -0.506668

In [25]:
df['20130102':'20130104'] #index가 20130102이상 20130104미만은 행 출력

                   A         B         C         D
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314
2013-01-03 -1.158142  0.771705  0.579984 -0.506668
2013-01-04  1.856392  0.006193  0.746496 -0.089361

In [26]:
#loc는 해당 위치의 값을 출력, index의 값이 옴.
df.loc[dates[0]] #1행의 값을 출력

A   -1.183526
B   -0.759022
C    0.577284
D   -1.592506
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']] #인덱스 값이 A,B인 열을 출력

                   A         B
2013-01-01 -1.183526 -0.759022
2013-01-02 -0.677577  0.762542
2013-01-03 -1.158142  0.771705
2013-01-04  1.856392  0.006193
2013-01-05 -2.955706 -0.340287
2013-01-06 -0.495877 -0.638595

In [28]:
df.loc['20130102':'20130104',['A','B']] #행의 인덱스가 20130102에서 20130104이며, 열의 인덱스가 A,B인 값을 출력

                   A         B
2013-01-02 -0.677577  0.762542
2013-01-03 -1.158142  0.771705
2013-01-04  1.856392  0.006193

In [29]:
df.loc['20130102',['A','B']] #행의 인덱스가 20130102이고, 열의 인덱스가 A,B인 값을 출력

A   -0.677577
B    0.762542
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A'] #행의 인덱스가 20130101이며, 열의 인덱스가 A인 값 출력

-1.1835255780133762

In [31]:
 df.at[dates[0],'A'] #위의 loc[dates[0],'A']와 같은 값을 가지지만 처리 속도가 빠르다

-1.1835255780133762

In [32]:
#iloc는 입력값이 정수만 넣을 수 있다.
df.iloc[3] #4번째 행의 값을 출력

A    1.856392
B    0.006193
C    0.746496
D   -0.089361
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5,0:2] #4~5번째행이며, 1~2번째 열의 값을 출력

                   A         B
2013-01-04  1.856392  0.006193
2013-01-05 -2.955706 -0.340287

In [34]:
df.iloc[[1,2,4],[0,2]] #행의 인덱스가 1,2,4(2,3,5행)이고, 열의 인덱스가 0,1(1,2행)을 출력

                   A         C
2013-01-02 -0.677577 -1.611383
2013-01-03 -1.158142  0.579984
2013-01-05 -2.955706 -0.318017

In [35]:
df.iloc[1:3,:] #2,3행을 출력

                   A         B         C         D
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314
2013-01-03 -1.158142  0.771705  0.579984 -0.506668

In [36]:
 df.iloc[:,1:3] #2,3열을 출력

                   B         C
2013-01-01 -0.759022  0.577284
2013-01-02  0.762542 -1.611383
2013-01-03  0.771705  0.579984
2013-01-04  0.006193  0.746496
2013-01-05 -0.340287 -0.318017
2013-01-06 -0.638595 -1.250311

In [37]:
df.iloc[1,1] #2행2열값을 출력

0.76254167107318238

In [38]:
df.iat[1,1] #2행2열값을 출력

0.76254167107318238

In [39]:
df[df.A > 0] #A열의 값이 0보다 큰 행만 출력

                   A         B         C         D
2013-01-04  1.856392  0.006193  0.746496 -0.089361

In [40]:
df[df > 0] #Data Frame df의 값이 0보다 작으면 NaN(Not a Number)를 출력

                   A         B         C       D
2013-01-01       NaN       NaN  0.577284     NaN
2013-01-02       NaN  0.762542       NaN     NaN
2013-01-03       NaN  0.771705  0.579984     NaN
2013-01-04  1.856392  0.006193  0.746496     NaN
2013-01-05       NaN       NaN       NaN  0.2882
2013-01-06       NaN       NaN       NaN     NaN

In [41]:
df2 = df.copy() #Data Frame df를 복사

In [42]:
df2['E'] = ['one', 'one','two','three','four','three'] #E열의 값을 수정

In [43]:
df2

                   A         B         C         D      E
2013-01-01 -1.183526 -0.759022  0.577284 -1.592506    one
2013-01-02 -0.677577  0.762542 -1.611383 -0.826314    one
2013-01-03 -1.158142  0.771705  0.579984 -0.506668    two
2013-01-04  1.856392  0.006193  0.746496 -0.089361  three
2013-01-05 -2.955706 -0.340287 -0.318017  0.288200   four
2013-01-06 -0.495877 -0.638595 -1.250311 -1.560737  three

In [44]:
#isin(입력), 입력된 값 중에서 해당 되는 값이 있으면 참, 없으면 거짓
df2[df2['E'].isin(['two','four'])] #E열 값이 two와 four인 행 출력

                   A         B         C         D     E
2013-01-03 -1.158142  0.771705  0.579984 -0.506668   two
2013-01-05 -2.955706 -0.340287 -0.318017  0.288200  four

In [45]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6)) #행의 인덱스는 20130102~20130107이며 각 행의 값은 1~6을 가진 Series 생성

In [46]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [47]:
df['F'] = s1 #Data Frame df의 f열을 Series S1으로 수정

In [48]:
df.at[dates[0],'A'] = 0 #1행의 A열의 값을 0으로 설정

In [49]:
df.iat[0,1] = 0 #1행의 2번째열(B열)의 값을 0으로 설정

In [50]:
#len은 입력된 자료구조의 길이
df.loc[:,'D'] = np.array([5] * len(df)) #D열의 값을 5로 설정

In [51]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.577284  5 NaN
2013-01-02 -0.677577  0.762542 -1.611383  5   1
2013-01-03 -1.158142  0.771705  0.579984  5   2
2013-01-04  1.856392  0.006193  0.746496  5   3
2013-01-05 -2.955706 -0.340287 -0.318017  5   4
2013-01-06 -0.495877 -0.638595 -1.250311  5   5

In [52]:
df2 = df.copy()

In [53]:
df2[df2 > 0] = -df2 #df2의 값이 0보다 크면 -로 수정

In [54]:
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.577284 -5 NaN
2013-01-02 -0.677577 -0.762542 -1.611383 -5  -1
2013-01-03 -1.158142 -0.771705 -0.579984 -5  -2
2013-01-04 -1.856392 -0.006193 -0.746496 -5  -3
2013-01-05 -2.955706 -0.340287 -0.318017 -5  -4
2013-01-06 -0.495877 -0.638595 -1.250311 -5  -5

In [55]:
#reindex : 입력된 인덱스를 수정
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E']) #행 인덱스를 1~4행까지 유지하고,(dates에서 불러옴) 열은 기존의 ABCDF에 E를 추가

In [56]:
df1.loc[dates[0]:dates[1],'E'] = 1 #1,2행의 E열 값을 1로 설정

In [57]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  0.577284  5 NaN   1
2013-01-02 -0.677577  0.762542 -1.611383  5   1   1
2013-01-03 -1.158142  0.771705  0.579984  5   2 NaN
2013-01-04  1.856392  0.006193  0.746496  5   3 NaN

In [58]:
#dropna : NA 값이 있으면 버림, how='any' 이면 NA가 하나라도 있으면, 'all'이면 전부 NA이면 드랍
df1.dropna(how='any')

                   A         B         C  D  F  E
2013-01-02 -0.677577  0.762542 -1.611383  5  1  1

In [59]:
#fillna : 값이 NA/NAN이면 지정된 값으로 설정
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000  0.577284  5  5  1
2013-01-02 -0.677577  0.762542 -1.611383  5  1  1
2013-01-03 -1.158142  0.771705  0.579984  5  2  5
2013-01-04  1.856392  0.006193  0.746496  5  3  5

In [60]:
#NUMLL값이면 True, 아니면 False
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [61]:
#mean : 평균, 입력이 0이면 열의 평균을, 1이면 행의 평균을 계산
df.mean() #각열의 평균을 계산

A   -0.571818
B    0.093593
C   -0.212658
D    5.000000
F    3.000000
dtype: float64

In [62]:
df.mean(1) #행의 평균을 계산

2013-01-01    1.394321
2013-01-02    0.894716
2013-01-03    1.438709
2013-01-04    2.121816
2013-01-05    1.077198
2013-01-06    1.523043
Freq: D, dtype: float64

In [63]:
#shift : 입력된 값만큼 값들을 이동시키고 빈 공간은 NAN으로 채움
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [64]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(1)
s

2013-01-01   NaN
2013-01-02     1
2013-01-03     3
2013-01-04     5
2013-01-05   NaN
2013-01-06     6
Freq: D, dtype: float64

In [65]:
#sub : 값 중에 NaN이 있는 행 또는 열을 뺀다.
#sub(other, axis='columns', level=None, fill_value=None)
#ohter : Series, DataFrame, constant, 
#axis : {0,1, index’,‘columns’}
#level : int or name
#fill_value : None or float value, default None
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02 -1.677577 -0.237458 -2.611383   4   0
2013-01-03 -4.158142 -2.228295 -2.420016   2  -1
2013-01-04 -3.143608 -4.993807 -4.253504   0  -2
2013-01-05       NaN       NaN       NaN NaN NaN
2013-01-06 -6.495877 -6.638595 -7.250311  -1  -1

In [66]:
#apply(func, axis=0, broadcast=False, raw=False, reduce=None, args=())
#입력된 함수를 적용
df.apply(np.cumsum) #cumsum : 각 열을 기준으로 합을 누적함

                   A         B         C   D   F
2013-01-01  0.000000  0.000000  0.577284   5 NaN
2013-01-02 -0.677577  0.762542 -1.034099  10   1
2013-01-03 -1.835719  1.534247 -0.454115  15   3
2013-01-04  0.020673  1.540440  0.292381  20   6
2013-01-05 -2.935033  1.200153 -0.025636  25  10
2013-01-06 -3.430910  0.561558 -1.275948  30  15

In [67]:
df.apply(lambda x: x.max() - x.min()) #각 열의 최댓값에서 최소값을 뺀 값

A    4.812097
B    1.410300
C    2.357879
D    0.000000
F    4.000000
dtype: float64

In [68]:
s = pd.Series(np.random.randint(0, 7, size=10)) #10개의 0~7사이에 값을 가지는 Series를 생성

In [69]:
s

0    5
1    1
2    4
3    0
4    4
5    3
6    3
7    2
8    4
9    6
dtype: int32

In [70]:
s.value_counts() #각 값이 몇개씩 있는지 출력

4    3
3    2
6    1
5    1
2    1
1    1
0    1
dtype: int64

In [71]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [72]:
s.str.lower() #전부 소문자로 변환

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [73]:
df = pd.DataFrame(np.random.randn(10, 4)) #10x4 DataFrame 생성
df

          0         1         2         3
0 -1.358453  0.115269 -1.352041  0.292568
1  0.237712  1.033189  0.041984  0.283846
2 -1.645649  0.147321 -2.384528  0.475934
3  0.587075  1.730653 -1.615691 -1.580050
4  0.263422 -0.010666  0.292765  0.440178
5  0.924652  1.441610 -0.913286  1.442630
6 -1.460110  1.054264 -2.892890  1.837259
7 -0.171523  2.167226  1.185472 -0.673470
8  0.711641 -1.047926 -0.309952 -0.298948
9 -0.938801 -0.068734  0.815931 -0.079139

In [74]:
pieces = [df[:3], df[3:7], df[7:]]

In [75]:
pieces

[          0         1         2         3
 0 -1.358453  0.115269 -1.352041  0.292568
 1  0.237712  1.033189  0.041984  0.283846
 2 -1.645649  0.147321 -2.384528  0.475934,
           0         1         2         3
 3  0.587075  1.730653 -1.615691 -1.580050
 4  0.263422 -0.010666  0.292765  0.440178
 5  0.924652  1.441610 -0.913286  1.442630
 6 -1.460110  1.054264 -2.892890  1.837259,
           0         1         2         3
 7 -0.171523  2.167226  1.185472 -0.673470
 8  0.711641 -1.047926 -0.309952 -0.298948
 9 -0.938801 -0.068734  0.815931 -0.079139]

In [76]:
pd.concat(pieces) #3개로 나뉜 pieces를 하나로 이어줌

          0         1         2         3
0 -1.358453  0.115269 -1.352041  0.292568
1  0.237712  1.033189  0.041984  0.283846
2 -1.645649  0.147321 -2.384528  0.475934
3  0.587075  1.730653 -1.615691 -1.580050
4  0.263422 -0.010666  0.292765  0.440178
5  0.924652  1.441610 -0.913286  1.442630
6 -1.460110  1.054264 -2.892890  1.837259
7 -0.171523  2.167226  1.185472 -0.673470
8  0.711641 -1.047926 -0.309952 -0.298948
9 -0.938801 -0.068734  0.815931 -0.079139

In [77]:
left = pd.DataFrame({'key': ['foo', 'fou'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [78]:
left

   key  lval
0  foo     1
1  fou     2

In [79]:
right

   key  rval
0  foo     4
1  foo     5

In [80]:
#merge : 두 개의 DataFrame을 같은 key를 가지는 값들을 병합
pd.merge(left, right, on='key') #key를 기준으로 모든 경우 생성

   key  lval  rval
0  foo     1     4
1  foo     1     5

In [81]:
pd.merge(left, right)

   key  lval  rval
0  foo     1     4
1  foo     1     5

In [82]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.081431  0.786208  0.844166 -2.506180
1  0.433619  0.218363 -0.078388 -0.561021
2  0.584072  2.056940 -0.315893 -1.136089
3  1.197671 -1.377724  1.133542 -0.798190
4 -0.222255 -1.943535 -1.399307 -0.858915
5  0.358030 -0.062691 -0.599067  2.369325
6  0.036443 -0.294896 -1.143355  1.514734
7 -0.698493  1.504230 -0.660403  0.864469

In [83]:
s = df.iloc[3] #df에서 4행을 추출하여 s로 만듬

In [84]:
#append Data를 이어 붙임
df.append(s, ignore_index=False) #ignore_index가 false이면 인덱스가 중복되던지 아닌지 신경안씀

          A         B         C         D
0 -0.081431  0.786208  0.844166 -2.506180
1  0.433619  0.218363 -0.078388 -0.561021
2  0.584072  2.056940 -0.315893 -1.136089
3  1.197671 -1.377724  1.133542 -0.798190
4 -0.222255 -1.943535 -1.399307 -0.858915
5  0.358030 -0.062691 -0.599067  2.369325
6  0.036443 -0.294896 -1.143355  1.514734
7 -0.698493  1.504230 -0.660403  0.864469
3  1.197671 -1.377724  1.133542 -0.798190

In [85]:
df.append(s, ignore_index=True) #ignore_index가 True이면 인덱스가 중복되지 않도록 이후 인덱스를 붙여준다.

          A         B         C         D
0 -0.081431  0.786208  0.844166 -2.506180
1  0.433619  0.218363 -0.078388 -0.561021
2  0.584072  2.056940 -0.315893 -1.136089
3  1.197671 -1.377724  1.133542 -0.798190
4 -0.222255 -1.943535 -1.399307 -0.858915
5  0.358030 -0.062691 -0.599067  2.369325
6  0.036443 -0.294896 -1.143355  1.514734
7 -0.698493  1.504230 -0.660403  0.864469
8  1.197671 -1.377724  1.133542 -0.798190

In [86]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                            'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.337959 -1.059759
1  bar    one -1.160830 -0.063800
2  foo    two  0.335634 -0.601710
3  bar  three -0.941268  0.969259
4  foo    two -1.809677 -0.345351
5  bar    two -0.221629  0.248106
6  foo    one  0.822552 -0.194719
7  foo  three -1.180623  0.246758

In [87]:
df.groupby('A').sum() #A열 값이 같은 값들의 합을 계산

            C         D
A
bar -2.323728  1.153565
foo -1.494156 -1.954782

In [88]:
df.groupby(['A','B']).sum() #A와 B열의 값이 같은 값들의 합을 계산

                  C         D
A   B
bar one   -1.160830 -0.063800
    three -0.941268  0.969259
    two   -0.221629  0.248106
foo one    1.160511 -1.254479
    three -1.180623  0.246758
    two   -1.474044 -0.947061

In [89]:
#리스트를 섞음
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [90]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second']) #
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B']) #8x2 DataFrame 생성
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.854080 -0.711254
      two    -0.402849  0.028316
baz   one    -0.166048 -0.351682
      two     0.000169  0.949247

In [91]:
#stack() 열의 수준을 낮춤
stacked = df2.stack()
stacked #first, second, A, B의 4개의 열에서 first, second 2개의 열로 줌

first  second
bar    one     A   -0.854080
               B   -0.711254
       two     A   -0.402849
               B    0.028316
baz    one     A   -0.166048
               B   -0.351682
       two     A    0.000169
               B    0.949247
dtype: float64

In [92]:
stacked.unstack() #열의 수준을 다시 되돌림, -1이 생략됨

                     A         B
first second
bar   one    -0.854080 -0.711254
      two    -0.402849  0.028316
baz   one    -0.166048 -0.351682
      two     0.000169  0.949247

In [93]:
stacked.unstack(1)

second        one       two
first
bar   A -0.854080 -0.402849
      B -0.711254  0.028316
baz   A -0.166048  0.000169
      B -0.351682  0.949247

In [94]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.854080 -0.166048
       B -0.711254 -0.351682
two    A -0.402849  0.000169
       B  0.028316  0.949247

In [95]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                    'B' : ['A', 'B', 'C'] * 4,
                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                    'D' : np.random.randn(12),
                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -1.815533 -0.221958
1     one  B  foo -0.370789  0.983893
2     two  C  foo  3.580670  1.345522
3   three  A  bar -0.015170  0.241151
4     one  B  bar -1.827160 -0.585329
5     one  C  bar  1.283998  1.031916
6     two  A  foo  2.616245  0.424199
7   three  B  foo  0.687256 -0.351149
8     one  C  foo  2.073029  1.017737
9     one  A  bar  0.316776  1.645357
10    two  B  bar  0.278099  0.933526
11  three  C  bar  1.211867  0.793720

In [96]:
# 인덱스는 A,B열의 값, key는 C열의 값
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C']) #스프레드 쉬트의 피번 테이블 생성,

C             bar       foo
A     B
one   A  0.316776 -1.815533
      B -1.827160 -0.370789
      C  1.283998  2.073029
three A -0.015170       NaN
      B       NaN  0.687256
      C  1.211867       NaN
two   A       NaN  2.616245
      B  0.278099       NaN
      C       NaN  3.580670

In [97]:
rng = pd.date_range('1/1/2012', periods=100, freq='S') #2012-01-01 0초를 기준으로 100개의 날짜를 생성

In [98]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng) #100개의 0에서 500사이의 정수를 갖는 Series 생성, 인덱스는 위에서 생성한 날짜

In [99]:
ts.resample('1Min', how='sum') #초 단위로 생성한 ts를 1분 단위로 수정하고, 누락된 값들은 합한다.

2012-01-01 00:00:00    14320
2012-01-01 00:01:00     9712
Freq: T, dtype: int32

In [100]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D') #시간 간격이 day

In [101]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [102]:
ts

2012-03-06    0.070058
2012-03-07   -0.124490
2012-03-08    0.119077
2012-03-09   -0.209312
2012-03-10   -0.141065
Freq: D, dtype: float64

In [103]:
ts_utc = ts.tz_localize('UTC') #타임존이 UTC
ts_utc

2012-03-06 00:00:00+00:00    0.070058
2012-03-07 00:00:00+00:00   -0.124490
2012-03-08 00:00:00+00:00    0.119077
2012-03-09 00:00:00+00:00   -0.209312
2012-03-10 00:00:00+00:00   -0.141065
Freq: D, dtype: float64

In [104]:
ts_utc.tz_convert('US/Eastern') #타임존이 US/Eastern

2012-03-05 19:00:00-05:00    0.070058
2012-03-06 19:00:00-05:00   -0.124490
2012-03-07 19:00:00-05:00    0.119077
2012-03-08 19:00:00-05:00   -0.209312
2012-03-09 19:00:00-05:00   -0.141065
Freq: D, dtype: float64

In [105]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.140515
2012-02-29   -0.490717
2012-03-31   -0.250973
2012-04-30   -1.309224
2012-05-31   -0.694502
Freq: M, dtype: float64

In [106]:
ps = ts.to_period() #freq 이하는 삭제, freq가 Month이므로 day이하는 삭제
ps

2012-01   -0.140515
2012-02   -0.490717
2012-03   -0.250973
2012-04   -1.309224
2012-05   -0.694502
Freq: M, dtype: float64

In [107]:
ps.to_timestamp() #기간의 시작일을 출력

2012-01-01   -0.140515
2012-02-01   -0.490717
2012-03-01   -0.250973
2012-04-01   -1.309224
2012-05-01   -0.694502
Freq: MS, dtype: float64

In [108]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [109]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [110]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9 
#1990Q1를 1990-03-00으로 바꾸고 +1를 하여 1990-03-01로 수정
#1990-03-01에서 09:00를 추가

In [111]:
ts.head() #처음부터 n개 행을 출력(기본 5개)

1990-03-01 09:00   -0.148906
1990-06-01 09:00    0.707274
1990-09-01 09:00    2.574295
1990-12-01 09:00   -1.745661
1991-03-01 09:00   -1.095560
Freq: H, dtype: float64

In [112]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [113]:
df["grade"] = df["raw_grade"].astype("category") #grade를 생성하는데 그 값으로 raw_grade의 값을 넣어준다.

In [114]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [115]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [116]:
df["grade"].cat.categories = ["very good", "good", "very bad"] #a,b,e -> very good, good, very bad로 수정
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [117]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"]) #카테 고리를 설정
df.sort("grade") #grade를 기준으로 정렬

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [118]:
df.groupby("grade").size() #grade의 카테고리의 값의 수를 출력

grade
very bad      1
bad         NaN
medium      NaN
good          2
very good     3
dtype: float64

In [119]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [120]:
ts = ts.cumsum() #각 값들을 누적합으로 수정

In [121]:
ts.plot() #ts를 이용하여 DataFrame의 plot을 생성
plt.show() #plot을 보기

In [122]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])

In [123]:
df = df.cumsum() #각 값들을 누적합으로 수정

In [124]:
#plt.figure();

In [125]:
df.plot(); 
plt.legend(loc='best')
plt.show()

In [126]:
df.to_csv('foo.csv') #df를 csv 파일로 저장

In [127]:
pd.read_csv('foo.csv') #csv 파일 읽기

     Unnamed: 0         A         B          C          D
0    2000-01-01  0.720184  1.145068   0.296746   1.403372
1    2000-01-02  0.080180  0.881209  -0.004070   2.632980
2    2000-01-03 -0.668266 -0.048997   0.146389   3.643981
3    2000-01-04 -2.560453 -0.851944   0.776143   3.503279
4    2000-01-05 -3.170985 -0.725592   0.939510   4.260059
5    2000-01-06 -2.086290 -2.195345   1.788412   4.873189
6    2000-01-07 -2.713587 -2.120298   1.631056   4.125563
7    2000-01-08 -2.187842 -0.623890  -0.857832   3.258293
8    2000-01-09 -5.142448 -0.088332  -1.843336   2.643946
9    2000-01-10 -6.621683  0.587062  -2.338365   2.459908
10   2000-01-11 -5.594090  0.695669  -1.617166   3.046890
11   2000-01-12 -6.087081  1.180825  -1.531951   4.615362
12   2000-01-13 -6.568171  0.771923  -1.849968   3.889853
13   2000-01-14 -7.733404  0.001151  -1.861116   4.015063
14   2000-01-15 -7.344260  0.880774  -1.875782   3.746171
15   2000-01-16 -6.503507  1.027026  -3.511638   3.649727
16   2000-01-17 -5.788276 -0.192544  -3.855305   2.222832
17   2000-01-18 -4.692671 -0.556919  -4.445647   2.470242
18   2000-01-19 -3.085059 -0.147120  -4.569909   2.758616
19   2000-01-20 -3.079367  0.824161  -4.473899   2.155984
20   2000-01-21 -3.217468  0.284854  -5.686331   1.370322
21   2000-01-22 -4.511828  0.202087  -4.967741   1.939600
22   2000-01-23 -4.941407 -0.023988  -4.676059   0.295107
23   2000-01-24 -5.754385  0.947737  -6.598652  -0.980154
24   2000-01-25 -5.788158  1.606050  -7.130166  -1.382854
25   2000-01-26 -4.851492  1.143663  -7.272899  -2.289895
26   2000-01-27 -3.543582 -0.061651  -7.708062  -5.620432
27   2000-01-28 -2.641268  1.202697  -7.178594  -7.621863
28   2000-01-29 -3.531281  2.993055  -7.485756  -9.162380
29   2000-01-30 -4.718074  3.662367  -7.245993  -9.524052
..          ...       ...       ...        ...        ...
970  2002-08-28 -1.773999  2.067923 -32.707305 -51.981396
971  2002-08-29 -1.095910  1.487191 -32.739971 -53.304640
972  2002-08-30 -1.704696  1.293352 -32.493875 -53.498387
973  2002-08-31 -3.711022  1.008245 -32.937220 -53.974283
974  2002-09-01 -2.009627  1.887979 -31.869893 -54.818031
975  2002-09-02 -2.899561  2.834986 -31.282610 -56.227484
976  2002-09-03 -3.626834  2.923840 -30.701109 -54.947889
977  2002-09-04 -3.097126  2.509267 -30.502681 -53.986145
978  2002-09-05 -2.347306  2.649113 -30.708935 -54.218772
979  2002-09-06 -3.210232  3.403812 -31.283199 -53.552116
980  2002-09-07 -4.905469  3.329984 -31.177169 -52.526936
981  2002-09-08 -4.672164  3.864331 -29.507795 -52.166528
982  2002-09-09 -4.901839  3.443593 -30.653534 -53.001023
983  2002-09-10 -5.151511  4.168757 -28.868396 -51.383805
984  2002-09-11 -5.873801  4.108429 -28.238984 -52.887617
985  2002-09-12 -5.922667  4.542248 -28.570522 -52.651269
986  2002-09-13 -6.027026  3.849346 -27.929378 -52.596981
987  2002-09-14 -6.040473  3.505894 -29.299683 -54.239762
988  2002-09-15 -5.536741  2.920209 -29.964323 -55.606357
989  2002-09-16 -4.773294  4.782043 -31.201792 -54.184607
990  2002-09-17 -3.125209  4.559245 -31.992559 -54.347033
991  2002-09-18 -3.105734  6.929814 -30.888002 -54.397427
992  2002-09-19 -4.177536  7.410386 -30.904007 -53.919297
993  2002-09-20 -4.530261  7.806804 -31.890367 -53.772922
994  2002-09-21 -5.641649  9.005481 -31.775808 -54.085173
995  2002-09-22 -5.968518  8.864642 -29.651050 -54.774569
996  2002-09-23 -5.304974  7.928575 -29.584515 -56.766766
997  2002-09-24 -3.643425  7.159727 -29.095425 -57.766184
998  2002-09-25 -4.459842  6.588109 -30.106894 -57.074358
999  2002-09-26 -5.754693  7.132693 -29.747805 -56.867035

[1000 rows x 5 columns]

In [128]:
#df.to_hdf('foo.h5','df',mode='w',format='table')
#ImportError: HDFStore requires PyTables, "No module named tables" problem importing

In [129]:
#df.to_excel('foo.xlsx', sheet_name='Sheet1')
#No module named openpyxl

In [130]:
#pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])